app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" = '"G", "PG", "PG-13", "R"'  ORDER BY release_date
---
  def index
    do_redirect = false
    if not params[:order_by].nil?
      session[:order_by] = params[:order_by]
    elsif not session[:order_by].nil?
      flash.keep
      params[:order_by] = session[:order_by]
      do_redirect = true
    end
    @all_ratings = Movie.ratings
    if not params[:ratings].nil?
      @chosen_ratings = params[:ratings].keys
      session[:chosen_ratings] = params[:ratings].keys
    elsif not session[:chosen_ratings].nil?
      flash.keep
      params[:ratings] = Hash[session[:chosen_ratings].map { |rating| [rating, '1'] }]
      @chosen_ratings = session[:chosen_ratings]
      do_redirect = true
    else
       @chosen_ratings = @all_ratings
    end
    if do_redirect then redirect_to movies_path(params) end
    flash.clear
    flash[session[:order_by]] = 'hilite'
    @movies = Movie.all.order(session[:order_by]).where(:rating => @chosen_ratings)